# Продемонстрируйте в режиме live-coding и объясните:
# - работу функции open в различных режимах;
# - чтение и запись данных в файл;
# - работу указателей.


# read


# readline


# readlines


# write в режиме 'w' очищает содержимое файла


# write в режиме 'a' не очищает содержимое файла


# writelines

# переместим курсор в начало файла


# перемещение курсора в конец файла
# file.seek(0, 2)












# Продемонстрируйте в режиме live-coding и объясните:
# - работу менеджера контекста;
# - чтение и запись данных в json-формате.
