# Задание 1: Реализация геттера и сеттера для класса Person
# Описание:
#
# Создайте класс Person, который будет иметь приватные атрибуты name и age.
# Реализуйте геттеры и сеттеры для этих атрибутов без использования декораторов.
#
# Требования:
#
# Приватные атрибуты __name и __age.
# Методы get_name и set_name для доступа и изменения атрибута __name.
# Методы get_age и set_age для доступа и изменения атрибута __age.
# Проверка, что возраст не может быть отрицательным.
#
# Задание 2: Реализация геттера и сеттера для класса Rectangle
# Описание:
#
# Создайте класс Rectangle, который будет иметь приватные атрибуты width и height.
# Реализуйте геттеры и сеттеры для этих атрибутов без использования декораторов.
#
# Требования:
#
# Приватные атрибуты __width и __height.
# Методы get_width и set_width для доступа и изменения атрибута __width.
# Проверка, что ширина должна быть положительной.
# Методы get_height и set_height для доступа и изменения атрибута __height.
# Проверка, что высота должна быть положительной.
