# Основные функции модуля math

import math

# Округление числа до ближайшего целого числа в меньшую сторону
print('# Округление числа до ближайшего целого числа в меньшую сторону')
print(math.floor(4.7))

# Округление числа до ближайшего целого числа в большую сторону
print('# Округление числа до ближайшего целого числа в большую сторону')
print(math.ceil(4.2))

# Отбрасывание дробной части и возврат целого числа
print('# Отбрасывание дробной части и возврат целого числа')
print(math.trunc(4.1))

# Вычисление квадратного корня числа
print('# Вычисление квадратного корня числа')
print(math.sqrt(16))

# Вычисление факториала числа
print('# Вычисление факториала числа')
print(math.factorial(1000))

# Возведение числа в степень
print('# Возведение числа в степень')
print(math.pow(2, 12))
print(2 ** 12)
